// Последовательность Фибоначчи образуется так: первый и второй члены последовательности равны 1, 
// каждый следующий равен сумме двух предыдущих (1, 1, 2, 3, 5, 8, 13, …). Дано натуральное число n (n > 3).
// а) Найти k-й член последовательности Фибоначчи.
// б) Получить первые n членов последовательности Фибоначчи.
// в) Верно ли, что сумма первых n членов последовательности Фибоначчи есть четное число?


// Console.WriteLine("Введите целое число");
// int n = Convert.ToInt32(Console.ReadLine());

// int num1 = 0;
// int num2 = 1;
// int num3 = 1;
// int sum = 1;

// for (int i = 0; i < n; i++)
// {
//     num3 = num1 + num2;
//     Console.Write($"{num3}, ");
//     num1 = num2;
//     num2 = num3;
//     sum = sum + num3;
// }

//  Одноклеточная амеба каждые 3 часа делится на 2 клетки. 
//  Определить, сколько клеток будет через 3, 6, 9, …, 24 часа, 
//  если первоначально была одна амеба.


Console.WriteLine("Введите целое число");
int n = Convert.ToInt32(Console.ReadLine());



for (int i = 0; i < n; i++)
{

}